docs: payment, auto sycn, deployment, readmd
